# UseOutsideAirPerPerson Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..UseOutsideAirPerPerson Property
EnergyDataSettings Class See Also
---
True if user is specifying outside air per person, false otherwise.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool UseOutsideAirPerPerson { get; set; }
```

Visual Basic
---
```text
Public Property UseOutsideAirPerPerson As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool UseOutsideAirPerPerson {
	bool get ();
	void set (bool value);
}
```

# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace